Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/quickstart--zoo-project_quickstart.tmx
Source language: en
Languages: ja

source: Zoo Project Quickstart
ja: Zoo プロジェクト クイックスタート

source: The ZOO-Project provides a developer friendly Web Processing Service (WPS) framework for creating and chaining Web Processing Services. A WPS provides web access to functions which run spatial algorithms.
ja: ZOOプロジェクトは、Web Processing Servicesを作成およびチェーンするための開発者向けのWeb Processing Service(WPS)フレームワークを提供します。WPSは空間アルゴリズムを実行する関数へのWebアクセスを提供します。

source: Start ZOO-Project
ja: ZOOプロジェクトを開始する

source: From the Start menu, select :menuselection:`Geospatial --> Web Services --> ZOO Project`.
ja: [スタート]メニューから:menuselection:`Geospatial-->Web Services-->ZOO Project`を選択します。

source: Firefox will open the ZOO Project demonstration landing page. From here, you can select a demon application.
ja: FirefoxはZOOプロジェクトのデモがある着地ページを開きます。ここから、デモアプリケーションを選択できます。

source: OGR spatial tools demo
ja: OGR空間ツールのデモ

source: On the ZOO Project demonstration landing page, click :guilabel:`view` on OGR spatial tools.
ja: ZOOプロジェクトのデモ着地ページで、OGR空間ツールの:guilabel:`ビュー`をクリックします。

source: Click on the map to select a feature from the :doc:`GeoServer <../overview/geoserver_overview>` WFS Server, the feature will be displayed in blue.
ja: 地図をクリックして:doc:`GeoServer<./overview/geoserver_overview>`WFS Serverから地物を選択すると、地物が青で表示されます。

source: Click on simple geometry process like Buffer, Centroid, ConvexHull or Boundary and the result will be displayed in yellow.
ja: バッファ、重心、凸包、境界などの単純なジオメトリ処理をクリックすると、結果が黄色で表示されます。

source: Now select another feature near the first you've selected, then click on a multiple geometries process button like Union, Intersection, Symmetric Difference or Difference to get the result displayed in red on the map.
ja: 最初に選択した地物の近くにある別のジオメトリを選択し、[和](Union)、[交差](Intersection)、[対称差](Symmetric Difference)、[差](Difference)などの複数のジオメトリの処理ボタンをクリックして、結果を地図上に赤で表示します。

source: CGAL triangulations demo
ja: CGAL三角形分割デモ

source: On the ZOO Project demonstration landing page, click :guilabel:`view` on CGAL triangulations.
ja: ZOOプロジェクトのデモ着地ページで、CGAL三角形分割の:guilabel:`view`をクリックします。

source: Press the Voronoi or Delaunay button to display on your map the result of the WPS service execution, as shown below.
ja: ボロノイまたはドロネーボタンを押して、以下に示すように、WPSサービスの実行結果をマップに表示します。

source: OTB Applications demo
ja: OTBアプリケーションのデモ

source: On the ZOO Project demonstration landing page, click :guilabel:`view` on OTB application.
ja: ZOOプロジェクトのデモ着地ページで、OTBアプリケーションの:guilabel:`view`をクリックします。

source: Fill the form on the left to configure the WPS service execution.
ja: 左側のフォームに入力して、WPSサービスの実行を設定します。

source: Once you have selected the values for your processing, press the :guilabel:`Execute` button at the bottom of the left form.
ja: 処理する値を選択したら、左側のフォームの下部にある:guilabel:`Execute`ボタンを押します。

source: If you chose image/png as the output format, you will see the result of your processing displayed on the map. You can see below a sample KMeansClassification execution when selecting the image/png output format.
ja: 出力形式としてimage/pngを選択した場合、処理結果が地図に表示されます。image/png出力フォーマットを選択すると、サンプルのKMeansClassification実行が表示されます。

source: What next?
ja: 次のステップ

source: You can access the capabilities of the ZOO WPS Server:
ja: ZOO WPSサーバーの機能にアクセスできます。

source: For further questions you can contact the ZOO Project mailing list: zoo-discuss@lists.osgeo.org
ja: 詳細については、ZOO Projectメーリングリスト:zoo-discuss@lists.osgeo.orgに問い合わせてください。
